In [17]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from datetime import datetime as dt
from matplotlib.dates import DateFormatter

In [3]:
%ls

KPMG Task 1 Sample ANS .docx            KPMG Task 1.docx
KPMG Task 1-1.ipynb                     KPMG_VI_New_raw_data_update_final.xlsx

In [4]:
# Import Raw Data
data = pd.ExcelFile("KPMG_VI_New_raw_data_update_final.xlsx")

In [5]:
# Seperate Data by Sheets
Transactions = pd.read_excel(data, 'Transactions')

In [6]:
Transactions.head(3)

,Note: The data and information in this document is reflective of a hypothetical situation and client. This document is to be used for KPMG Virtual Internship purposes only.,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12
0,transaction_id,product_id,customer_id,transaction_date,online_order,order_status,brand,product_line,product_class,product_size,list_price,standard_cost,product_first_sold_date
1,1,2,2950,2017-02-25 00:00:00,False,Approved,Solex,Standard,medium,medium,71.49,53.62,41245
2,2,3,3120,2017-05-21 00:00:00,True,Approved,Trek Bicycles,Standard,medium,large,2091.47,388.92,41701

In [7]:
new_header = Transactions.iloc[0]
Transactions = Transactions.iloc[1:]
Transactions.columns = new_header
Transactions.head(2)

,transaction_id,product_id,customer_id,transaction_date,online_order,order_status,brand,product_line,product_class,product_size,list_price,standard_cost,product_first_sold_date
1,1,2,2950,2017-02-25 00:00:00,False,Approved,Solex,Standard,medium,medium,71.49,53.62,41245
2,2,3,3120,2017-05-21 00:00:00,True,Approved,Trek Bicycles,Standard,medium,large,2091.47,388.92,41701

In [8]:
Transactions.shape

(20000, 13)

In [9]:
Transactions.describe()

,transaction_id,product_id,customer_id,transaction_date,online_order,order_status,brand,product_line,product_class,product_size,list_price,standard_cost,product_first_sold_date
count,20000,20000,20000,20000,19640,20000,19803,19803,19803,19803,20000.00,19803.00,19803
unique,20000,101,3494,364,2,2,6,4,3,3,296.00,103.00,100
top,1,0,2183,2017-02-14 00:00:00,True,Approved,Solex,Standard,medium,medium,2091.47,388.92,33879
freq,1,1378,14,82,9829,19821,4253,14176,13826,12990,465.00,465.00,234

In [10]:
Transactions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20000 entries, 1 to 20000
Data columns (total 13 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   transaction_id           20000 non-null  object
 1   product_id               20000 non-null  object
 2   customer_id              20000 non-null  object
 3   transaction_date         20000 non-null  object
 4   online_order             19640 non-null  object
 5   order_status             20000 non-null  object
 6   brand                    19803 non-null  object
 7   product_line             19803 non-null  object
 8   product_class            19803 non-null  object
 9   product_size             19803 non-null  object
 10  list_price               20000 non-null  object
 11  standard_cost            19803 non-null  object
 12  product_first_sold_date  19803 non-null  object
dtypes: object(13)
memory usage: 2.0+ MB

In [11]:
# Count Duplicated Items
Transactions.duplicated().sum()

0

In [12]:
# Count Unique Number of Items
Transactions.nunique()

0
transaction_id             20000
product_id                   101
customer_id                 3494
transaction_date             364
online_order                   2
order_status                   2
brand                          6
product_line                   4
product_class                  3
product_size                   3
list_price                   296
standard_cost                103
product_first_sold_date      100
dtype: int64

In [13]:
# Check for Missing Values for each Column
Transactions.isnull().sum()

0
transaction_id               0
product_id                   0
customer_id                  0
transaction_date             0
online_order               360
order_status                 0
brand                      197
product_line               197
product_class              197
product_size               197
list_price                   0
standard_cost              197
product_first_sold_date    197
dtype: int64

In [14]:
index = ['online_order', 'order_status', 'brand', 'product_line', 'product_class', 'product_size', 'list_price', 'standard_cost', 'product_first_sold_date']

for item in index:
    print(Transactions[item].value_counts())
    print('\n')

True     9829
False    9811
Name: online_order, dtype: int64


Approved     19821
Cancelled      179
Name: order_status, dtype: int64


Solex             4253
Giant Bicycles    3312
WeareA2B          3295
OHM Cycles        3043
Trek Bicycles     2990
Norco Bicycles    2910
Name: brand, dtype: int64


Standard    14176
Road         3970
Touring      1234
Mountain      423
Name: product_line, dtype: int64


medium    13826
high       3013
low        2964
Name: product_class, dtype: int64


medium    12990
large      3976
small      2837
Name: product_size, dtype: int64


2091.47    465
1403.50    396
71.49      274
1231.15    235
1890.39    233
          ...
56.21        1
126.36       1
1300.96      1
1697.27      1
867.92       1
Name: list_price, Length: 296, dtype: int64


388.920000    465
954.820000    396
53.620000     274
161.600000    235
260.140000    233
             ...
151.960000    124
206.350000    114
312.735016      1
270.299988      1
667.400024      1
Name: standard_cost, Length: 103, dtype: int64


33879    234
41064    229
37823    227
39880    222
38216    220
        ...
41848    169
42404    168
41922    166
37659    163
34586    162
Name: product_first_sold_date, Length: 100, dtype: int64

In [19]:
# Convert Product First Sold Date to an Actual Date
Transactions['product_first_sold_date'] = pd.TimedeltaIndex(Transactions['product_first_sold_date'], unit = 'd') + datetime(1900,1,1)

In [20]:
Transactions.head(3)

,transaction_id,product_id,customer_id,transaction_date,online_order,order_status,brand,product_line,product_class,product_size,list_price,standard_cost,product_first_sold_date
1,1,2,2950,2017-02-25 00:00:00,False,Approved,Solex,Standard,medium,medium,71.49,53.62,2012-12-04
2,2,3,3120,2017-05-21 00:00:00,True,Approved,Trek Bicycles,Standard,medium,large,2091.47,388.92,2014-03-05
3,3,37,402,2017-10-16 00:00:00,False,Approved,OHM Cycles,Standard,low,medium,1793.43,248.82,1999-07-22

In [21]:
Transactions_Cleaned = Transactions.dropna()
Transactions_Cleaned.shape

(19445, 13)

In [23]:
# Last Purchase Column for Further Analysis
last_purchase = Transactions_Cleaned['transaction_date'].max()

Transactions_Cleaned['Last_Purchase_Days'] = last_purchase - Transactions_Cleaned['transaction_date']
Transactions_Cleaned['Last_Purchase_Days'] /= np.timedelta64(1, 'D')

/var/folders/3m/x3f70vjj2y588096qxf43zn00000gp/T/ipykernel_5682/1703364213.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  Transactions_Cleaned['Last_Purchase_Days'] = last_purchase - Transactions_Cleaned['transaction_date']
/var/folders/3m/x3f70vjj2y588096qxf43zn00000gp/T/ipykernel_5682/1703364213.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  Transactions_Cleaned['Last_Purchase_Days'] /= np.timedelta64(1, 'D')

In [24]:
# Profit Column for Further Analysis
Transactions_Cleaned['Profit'] = Transactions_Cleaned['list_price'] - Transactions_Cleaned['standard_cost']

/var/folders/3m/x3f70vjj2y588096qxf43zn00000gp/T/ipykernel_5682/2881957906.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  Transactions_Cleaned['Profit'] = Transactions_Cleaned['list_price'] - Transactions_Cleaned['standard_cost']

In [25]:
Transactions_Cleaned.head(3)

,transaction_id,product_id,customer_id,transaction_date,online_order,order_status,brand,product_line,product_class,product_size,list_price,standard_cost,product_first_sold_date,Last_Purchase_Days,Profit
1,1,2,2950,2017-02-25 00:00:00,False,Approved,Solex,Standard,medium,medium,71.49,53.62,2012-12-04,308.0,17.87
2,2,3,3120,2017-05-21 00:00:00,True,Approved,Trek Bicycles,Standard,medium,large,2091.47,388.92,2014-03-05,223.0,1702.55
3,3,37,402,2017-10-16 00:00:00,False,Approved,OHM Cycles,Standard,low,medium,1793.43,248.82,1999-07-22,75.0,1544.61

In [26]:
# Save to csv file after the cleaning
Transactions_Cleaned.to_csv('./Transactions_cleaned.csv', index = False)